status/2020/19dec20.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>13 December 2020 - 19 December 2020</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">13 December 2020 - 19 December 2020</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org64c1090">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org8990e92">1.1. /dev/ttyUSB0 not found after reboot</a></li>
<li><a href="#orgf43b2e0">1.2. Add forecast link</a></li>
</ul>
</li>
<li><a href="#orga91ff8b">2. Github</a></li>
<li><a href="#orgaf6957e">3. EPICS</a></li>
<li><a href="#orgfe83133">4. Santa's Workshop</a>
<ul>
<li><a href="#orgc81e1ae">4.1. Oak Napkin holder</a></li>
<li><a href="#org41a4985">4.2. Low Angle Block Plane Drawing</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Third Week of Advent
</p>

<div id="outline-container-org64c1090" class="outline-2">
<h2 id="org64c1090"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8990e92" class="outline-3">
<h3 id="org8990e92"><span class="section-number-3">1.1.</span> /dev/ttyUSB0 not found after reboot</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://github.com/daniel-kelley/sczwx/issues/2">https://github.com/daniel-kelley/sczwx/issues/2</a>
Fixed. What a pain. Thought it could be fixed using systemd init,
but landed up with a wait loop in the serial port open.
</p>
</div>
</div>
<div id="outline-container-orgf43b2e0" class="outline-3">
<h3 id="orgf43b2e0"><span class="section-number-3">1.2.</span> Add forecast link</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://github.com/daniel-kelley/sczwx/issues/5">https://github.com/daniel-kelley/sczwx/issues/5</a>
Something simple! Added a link to NWS forecast.
</p>
</div>
</div>
</div>
<div id="outline-container-orga91ff8b" class="outline-2">
<h2 id="orga91ff8b"><span class="section-number-2">2.</span> Github</h2>
<div class="outline-text-2" id="text-2">
<p>
Finally converted development repositories to SSH.
</p>
</div>
</div>
<div id="outline-container-orgaf6957e" class="outline-2">
<h2 id="orgaf6957e"><span class="section-number-2">3.</span> EPICS</h2>
<div class="outline-text-2" id="text-3">
<p>
Mostly worked out SCPI command structure for U3HV for all commands.
</p>
</div>
</div>
<div id="outline-container-orgfe83133" class="outline-2">
<h2 id="orgfe83133"><span class="section-number-2">4.</span> Santa's Workshop</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc81e1ae" class="outline-3">
<h3 id="orgc81e1ae"><span class="section-number-3">4.1.</span> Oak Napkin holder</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Pieces done. Dovetails laid out and cut.
</p>
</div>
</div>
<div id="outline-container-org41a4985" class="outline-3">
<h3 id="org41a4985"><span class="section-number-3">4.2.</span> Low Angle Block Plane Drawing</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Trish needed a line drawing of a low angle block plane
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>